<?php

namespace Faker\Provider\ckb;

class Color extends \Faker\Provider\Color
{
    protected static $safeColorNames = [
        'ڕەش', 'چەرمسۆن', 'سەوز', 'شینی تۆخ', 'زەیتوون', 'ئەرخەوانی', 'سوور',
        'لێمی', 'شین', 'زیوی', 'خۆڵەمێشی', 'زەرد', 'پرتەقاڵی', 'قاوەیی', 'سپی'
    ];

    protected static $allColorNames = [
        'سەوزی کاڵ',
        'شینی کاڵ',
        'سووری کاڵ',
        'زەردی کاڵ',
        'قاوەیی کاڵ',
        'خۆڵەمێشی کاڵ',
        'ئەرخەوانی کاڵ',
        'زەیتوونی کاڵ',
        'هێزی دەریایی کاڵ',
        'گڵۆپی گڵۆپی',
        'ڕەشی کاڵ',
        'وەنەوشەی کاڵ',
        'پرتەقاڵی کاڵ',
        'زەیتوونی تۆخ',
        'هێزی دەریایی تۆخ',
        'سەوزی تۆخ',
        'لەرزی تۆخ',
        'شینی تۆخ',
        'سووری تۆخ',
        'ئەرخەوانی تۆخ',
        'کەنەوشەی تۆخ',
        'قاوەیی تۆخ',
        'پرتەقاڵی تۆخ',
        'زەردی تۆخ',
        'خۆڵەمێشی تۆخ',
        'پەمەیی',
        'پیرۆزە',
        'کرێمی',
        'شەکری',
        'بەفری',
        'لیمۆیی',
        'تۆ هەستەیت',
        'کامینس',
        'یرووزی',
        'بەهەشتی',
        'نیلی',
        'خەڵوز'
    ];
}
